server/load-tests/auth-load-test.yml
config:
  target: http://localhost:4000
  phases:
    - duration: 60
      arrivalRate: 5
      name: warmup
    - duration: 120
      arrivalRate: 50
      name: sustained
  thresholds:
    http.response_time.p95: 500
    http.response_time.p99: 1500
scenarios:
  - name: login flow
    flow:
      - post:
          url: /api/v1/auth/login
          json:
            email: e2e-director@example.com
            password: E2ePassword123!
          capture:
            - json: $.accessToken
              as: token
      - get:
          url: /api/v1/attendance/today
          headers:
            Authorization: 'Bearer {{ token }}'