server/load-tests/auth-load-test.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 200
      name: "Peak load"
    - duration: 60
      arrivalRate: 10
      name: "Cool down"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Login and Fetch Tasks"
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "admin@example.com"
            password: "Admin@123"
          capture:
            - json: "$.accessToken"
              as: "token"
      - get:
          url: "/api/v1/tasks"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 1
      - get:
          url: "/api/v1/attendance/today"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/notifications"
          headers:
            Authorization: "Bearer {{ token }}"