server/load-tests/tasks-load-test.yml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Ramp up"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./load-test-processor.js"

scenarios:
  - name: "Task Management Operations"
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "admin@example.com"
            password: "Admin@123"
          capture:
            - json: "$.accessToken"
              as: "token"
      - get:
          url: "/api/v1/tasks"
          headers:
            Authorization: "Bearer {{ token }}"
      - think: 2
      - get:
          url: "/api/v1/tasks?page=1&limit=10"
          headers:
            Authorization: "Bearer {{ token }}"
      - get:
          url: "/api/v1/tasks/stats"
          headers:
            Authorization: "Bearer {{ token }}"